                                                                                           
°ÙÀÖÓÎÏ·¿ª·¢ÎÄµµ:

ÓÎÏ·´úÂë¼°±àºÅ£º

1.°Ù¼ÒÀÖ(bjl)   2.Áú»¢(lh)   3.Å£Å£(nn)   4.Õ¨½ð»¨(xjh)  5.´óÐ¡(dx)   6.ÍÆÍ²×Ó(tts)   7.Ê±Ê±²Ê£¨ssc)  8.½­ËÕ¿ì3(jsk3)  9.±±¾©Èü³µ(bjcs)   10 ¶àÌ¨(dt)

±¾ÓÎÏ·Ô¤¼ÆÇ°¶Ë·ÖÎªpc,h5,°²×¿,Æ»¹û¡£ºó¶Ë²ÉÓÃpomelo¿ò¼Ü,´úÀí¶ËÓÃvueÇ°¶Ë¿ò¼Ü.Ì¨Ãæ³ÌÐò¶ËÓÃvc¡£
Ô¤¼ÆÓÎÏ·³ÐÔØÁ¿ÎªÍ¬Ê±ÔÚÏß10000ÈË,ÓÎÏ··þÎñÆ÷·Ö²¼²¼¾Ö¡£Êý¾Ý¿â¼Ü¹¹Îªmysql,²ÉÓÃÖ÷´Ó·½Ê½¡£

ËµÃ÷£º1.ËùÓÐÐ­Òé¾ùbase64¼ÓÃÜ£¬Êý¾ÝÁ¿´óÊ±¾¡Á¿¿¼ÂÇzipÑ¹Ëõ¡£
      
      2.ÊÔÍæÕËºÅ,Ò»¸öÐ¡Ê±Ö»ÄÜµÇÂ¼3´Î,5·ÖÖÓ²»ÏÂ×¢»á×Ô¶¯ÍË³ö.

      3.ÊÔÍæÕËºÅ,Ã¿´Î½øÈë(ÍË»Ø´óÌü)Ä¬ÈÏ200·Ö,½áËãµ«²»×÷ÎªÓ¯ÀûÒÀ¾Ý.

      4.redis×öÎªÊý¾Ý¿â»º´æ
  

Ç°¶ËÐ­Òé£º


Ò»¡¢ÕÊ»§·þÎñÆ÷(httpÖ¸Áî¸ñÊ½: url="http://124.248.245.226:3195/opt" & data=Ö¸Áî)

1.µÇÂ½£º

  Ö¸Áî: 01;ÕÊºÅ;ÃÜÂë(md5¼ÓÃÜ²¢¼ÓÑÎ);ÖÕ¶Ë    

  ·µ»Ø: 
  ³É¹¦: 1;1;userId;ye;tokey;name;enable                
  Ê§°Ü: 1;2
    ¡¡   
  ËµÃ÷: token:Á¬½ÓÔ¿³×,userId:ÓÃ»§id,ye:Óà¶î,name:ÕÊºÅ,enable:ÕÊºÅ½ûÆôÓÃ(1ÆôÓÃ 0½ûÓÃ),½ûÓÃ×´Ì¬ÏÂ½ûÖ¹µÇÂ¼
          ·µ»Ø³É¹¦ºóÖ±½ÓÁ¬½ÓÓÎÏ··þÎñÆ÷;¡¡

2.×¢²á£º

  Ö¸Áî: 02;ÕÊºÅ;ÃÜÂë(md5¼ÓÃÜ²¢¼ÓÑÎ);´úÀíºÅ;

  ·µ»Ø: 
  ³É¹¦: 2;1;userId;ye;tokey;name    
  Ê§°Ü: 2;2    (ÎÞ´Ë´úÀíÈË)
          2;3    (×¢²áÊ§°Ü)
          2;4    (¸ÃÕÊºÅÒÑÊ¹ÓÃ)
        ¡¡   
  ËµÃ÷: token:Á¬½ÓÔ¿³×,userId:ÓÃ»§id,ye:Óà¶î,name:ÕÊºÅ
          ·µ»Ø³É¹¦ºóÖ±½ÓÁ¬½ÓÓÎÏ··þÎñÆ÷;

3.ÓÎ¿ÍµÇÂ½:
¡¡Ö¸Áî: 03;
   ³É¹¦: 1;1;userId;ye;tokey;name;onLineNum;  
   Ê§°Ü: 1;2

  ËµÃ÷: ¿Í»§¶Ë×Ô¶¯¼ÆÊ±,Èç¹ûÓÎ¿ÍµÇÂ½ºó5·ÖÖÓÄÚÃ»ÓÐÏÂ×¢µÄ×Ô¶¯ÍË³ö¡£

¶þ¡¢ÓÎÏ··þÎñÆ÷(pomelo)

1.ËµÃ÷: 

  ÓÎÏ·ÖÐ·ÃÎÊ·þÎñÆ÷¸ñÊ½:   request ¸ñÊ½(¼´Ö±½Ó»Øµ÷¸ñÊ½)
  
  ¿Í»§¶ËÁ¬½Ó·þÎñÆ÷: "bjl.bjlHandler.?"                   //?ÊÇ·ÃÎÊº¯Êý
  Èç: var msg={userId:Global.pInfo.uid,roomId:1};
       var route:string = "bjl.bjlHandler.doSelectGame";
       rPomelo.pomelo.request(route, msg, function(res) {
            console.log("res:",res)
       })   
  
  
  ·þÎñÆ÷·µ»Ø¿Í»§¶Ë: £¨Èç£©
   {
      "code" : 1,
      "msg" : "µÇÂ¼³É¹¦",
      "rType" : "bjl"  ,
      "roomId" :1 ,
      "data":{ }
    }
   code:´úºÅ  msg:ÐÅÏ¢  rType:·¿¼äÀàÐÍ(»òÓÎÏ·ÀàÐÍ)  roomId:·¿¼äºÅ   data:Êý¾Ý
          

   ÓÎÏ··þÎñÆ÷¹¤×÷·½Ê½:
   a.Ê×ÏÈÍ¨¹ýÕËºÅ·þÎñÆ÷È¡»ØuserId,token(ÕâÒ»²½ÓÉÕÊºÅ·þÎñÆ÷ÊµÏÖ)
   b.Á¬½ÓÓÎÏ··þÎñÆ÷µÄgate·þÎñÆ÷,È¡µÃµÇÂ¼ipºÍ¶Ë¿Ú
   c.Í¨¹ýipºÍ¶Ë¿Ú,Á¬½Ócobjlector·þÎñÆ÷.
   d.Èç¹ûÁ¬½Ó³É¹¦,Ôò¿Í»§¶ËÔòÍ¨¹ýÖ±½ÓÍ¨¹ýhandleÂ·ÓÉ·ÃÎÊ·þÎñÆ÷,¾ßÌåÐ­ÒéÏÂÃæËµÃ÷¡£

   Èç¹ûµôÏß,ÖØ¸´b,c²½Öè
   

   ·þÎñÆ÷¹ã²¥:
   ¿Í»§¶Ë½ÓÊÕÂ·ÓÉ(º¯Êý): onMsg()   

2.Á¬½ÓÓÎÏ··þÎñÆ÷
 
  a.Á¬½Ógate·þÎñÆ÷: "gate.gateHandler.queryEntry"
    Á¬½Ó²ÎÊý: ip: 124.248.245.226
              port:3014   

    ³É¹¦·µ»Ø:   cobjlect·þÎñÆ÷µÄipºÍport

  b.Á¬½Ócobjlect·þÎñÆ÷: 
        pomelo.init({host: host,port: port,log: true}
        route="cobjlector.entryHandler.entry"
        pomelo.request(route, {userId:uid,token:token,rType:rType,roomId:roomId} 
    
    ³É¹¦·µ»Ø:   
                {
                    "code":200,                                                      //code:300   ÔòÎªÖØ¸´µÇÂ¼,Ç°¶ËÍË»ØµÇÂ¼½çÃæ
                    "msg":"Á¬½Ó³É¹¦",
                    "rType":""
                    "roomId":""
                    "data":{ 
                       players:{
                           bjl:0,
                           lh:0,
                           nn:0,
                           xjh:0,
                           dx:0,
                           tts:0,
                           ssc:0,
                           jsk3:0,
                           bjcs:0
                       },
                       url:"http://124.248.226.218:2222/a.jpg^http://124.248.226.218:2222/b.jpg^http://124.248.226.218:2222/c.jpg",
                       msg:" ",
                       wxh:" ",
                        ye:100
                     } 
                }       

        ËµÃ÷:   rType:·¿¼äÀàÐÍ(ÓÎÏ·ÀàÐÍ)    roomId:·¿¼äºÅ  players:¸÷ÓÎÏ·ÈËÊý  url:ÂÖ²¥¹ã¸æµØÖ·,Îª¿Õ¿Í»§¶ËÒ³ÃæÔòÄ¬ÈÏ   msg:´óÌü¹«¸æÐÅÏ¢   wxh:¿Í·þÎ¢ÐÅºÅ
  
        ×¢Òâ:   1.¸ÕµÇÂ¼ÕÊºÅ·þÎñÆ÷Á¬½ÓÓÎÏ··þÎñÆ÷£¬¼´´óÌü×´Ì¬£¬rTypeºÍroomIdÎª¿Õ¡£µÚÒ»´ÎÁ¬½ÓÊ¹ÓÃ,data·µ»Ø¸÷ÓÎÏ·µÄÈËÊý,url,msg,wxhµÈ.
                2.Èç¹ûÖ»Ñ¡ÔñÓÎÏ·Ã»ÓÐÑ¡Ôñ½øÈëÄ³¸ö·¿¼ä,ÔòroomIdÎª¿Õ¡£ÖØÁ¬Ê¹ÓÃ,data·µ»ØºÍÏÂÃæµÄdoSelectGame·µ»ØdataÖµÒ»Ñù
                3.Èç¹ûÑ¡ÔñÁËÄ³¸ö·¿¼äºÅ,ÔòrTypeºÍroomId¶¼±£´æÓÐÏà¶ÔÓ¦Öµ¡£ÖØÁ¬Ê¹ÓÃ,data·µ»ØºÍÏÂÃæµÄdoSelectDesk·µ»ØdataÖµÒ»Ñù
               
                
                  ²ÎÊýÒª±£´æºÃ,ÒÔ±ã¶ÏÏßÖØÁ¬Ê±ÖØÐÂÊ¹ÐÐ¸ÃÖ¸Áî.·þÎñÆ÷½«¸ù¾Ý¸÷²ÎÊý·µ»ØÏàÓ¦ÐÅÏ¢¡£

                                                 
3.½øÈë´óÌüÑ¡ÔñÓÎÏ·:  

  ¿Í»§¶ËÂ·ÓÉ:  "bjl.bjlHandler.doSelectGame"            //Å£Å£½øÈë bjlHandler   °ÙÀÖ½øÈë bjlHandler
        
  ·þÎñÆ÷·µ»Ø:  { 
                 "code":101,
                 "msg":"È¡·¿¼äÐÅÏ¢",
                 "rType":"bjl",
                 "roomId":"",
                 "data":"·¿¼äºÅ£¬ÏÞºì£¬×ÀÉÏ³ïÂë£¬ÓÎÏ·×´Ì¬£¬µ¹¼ÆÊ±£¬Â·µ¥,×ÜÈËÊý£¬³¡´Î£¬±¾Íæ¼Ò·ÖÊý£¬ºÉ¹Ù£¬ÏÂ×¢Ã÷Ï¸,·¿¼äÃû,ÊÓÆµµØÖ·,ÅâÂÊ,ÓÎÏ·ÀàÐÍ# ..."     //¶à¸ö·¿¼ä#¸ô¿ª,Èç¹ûdataÖµÎª¿ÕµÄ»°ÔòÃ»ÓÐ·¿¼äÔËÐÐ 
                }

   ×¢Òâ£º·¿¼äºÅºÍ·¿¼äÃûÊÇ²»Ò»ÑùµÄ£¬Ç°¶ËÓëºó¶ËÁªÏµÍ¨¹ý·¿¼äºÅ£¬µ«·¿¼äÃûÊÇÏÔÊ¾¸øÍæ¼Ò¿´µÄ¡£Èç°ÙÀÖ1ºÅ·¿¿ÉÄÜÆäÃû³ÆÊÇvip10,ÒÔºó°´´Ë±ê×¼
   ËµÃ÷: ·µ»ØËùÓÐÑ¡¶¨ÓÎÏ·µÄËùÓÐ·¿¼ä×´Ì¬,Ñ¡Ôñ¶àÌ¨Ê±,½øÈë¶àÌ¨´óÌü,È»ºóÑ¡ÔñÓÎÏ·(¼´Ê¹ÐÐ¸ÃÃüÁî)¡£
         ÓÎÏ·ÀàÐÍ£º1.bjl  2.lh ¾ßÌå²Î¿¼±¾ÎÄµÚÒ»ÌõÓÎÏ·´úÂë¼°±àºÅ£º
        
         Â·µ¥¸ñÊ½£ºabcdfed ... ,¾ßÌåÈçÏÂ: 
         a:×¯ 
         b:×¯ ÏÐ¶Ô
         c:×¯ ×¯¶Ô
         d:×¯ ÏÐ¶Ô ×¯¶Ô
         e:ÏÐ(Áú)
         f:ÏÐ ÏÐ¶Ô
         g:ÏÐ ×¯¶Ô
         h:ÏÐ ÏÐ¶Ô ×¯¶Ô
         i:ºÍ
         j:ºÍ ÏÐ¶Ô
         k:ºÍ ×¯¶Ô
         l:ºÍ ÏÐ¶Ô ×¯¶Ô
        
         ÏÂ×¢Ã÷Ï¸: Ö÷ÒªÊÇÎªÁËÖØÁ¬Ê±Ê¹ÓÃ,»òÕßÖØ½øÈë·¿¼äÊ±Ê¹ÓÃ,¸ñÊ½Èç:  1^10$2^100  ,¾ßÌå¹æÔò°´ÏÂ×¢ËµÃ÷¡£ 1×¯ 2ºÍ 3ÏÐ 4.×¯¶Ô 5ÏÐ¶Ô        

4.Ñ¡Ôñ×ÀºÅ(½øÈëÓÎÏ··¿¼ä)

  ¿Í»§¶ËÂ·ÓÉ:  "bjl.bjlHandler.doSelectDesk"
        ²ÎÊý:  "roomId":"1"                              //×¢Òâ,roomId ÓÐÊ±Ò²ÓÐÀàËÆ'VIP3'Ö®ÀàµÄ
  ·þÎñÆ÷·µ»Ø:  
               {
                 "code":102,
                 "msg":"È¡·¿¼äÐÅÏ¢",
                 "rType":"bjl",
                 "roomId":"3",             
                 "data"="·¿¼äºÅ,ÏÞºì,×ÀÉÏ³ïÂë,ÓÎÏ·×´Ì¬,µ¹¼ÆÊ±,Â·µ¥,×ÜÈËÊý,³¡´Î,±¾Íæ¼Ò·ÖÊý,ºÉ¹Ù,ÏÂ×¢Ã÷Ï¸,ÏÂ×¢Ê±¼ä,·¿¼äÃû,ÊÓÆµµØÖ·,ÅâÂÊ,ÓÎÏ·ÀàÐÍ"    //Èç¹ûdataÖµÎª¿ÕµÄ»°ÔòÃ»ÓÐ·¿¼äÔËÐÐ,ÏÂ×¢Ê±¼äÊÇ¹Ì¶¨µÄ
                }
         ËµÃ÷£º ×ÀÉÏ³ïÂë°´ÏÂ×¢Î»ÖÃ·¢,ÊÓÆµµØÖ·Ò»°ãÓÐ2-5¸ö,¿Í»§µãÉãÏñÍ·Ê±ÂÖÁ÷ÇÐ»»
    

5.ÏÂ×¢
  ¿Í»§¶ËÂ·ÓÉ:  "bjl.bjlHandler.doBet"
        ²ÎÊý:  "roomId":3 £¬
               "bet":1^20$5^10"                     //ÏÂ×¢Î»ÖÃ:1.×¯ 2.ºÍ 3.ÏÐ  4.×¯¶Ô 5.ÏÐ¶Ô   
  
  ·þÎñÆ÷·µ»Ø:  
               {
                 "code":"401",                      //403 ·ÇÏÂ×¢Ê±¼ä,402 ÏÂ×¢Ê§°Ü ,404 ½ð¶î²»×ã,405 ³¬¹ýÏÞºì
                 "msg":"ÏÂ×¢³É¹¦"
                 "rType":"bjl"
                 "roomId":"3"              
                 "data"={
                       ye:100,                      //Óà¶î,³É¹¦ÓÐÐ§£¬²»³É¹¦²»ÓÃÀí
                       bet:"1^100$2^100             //±¾´ÎÏÂ×¢Ã÷Ï¸,1.×¯ 2.ºÍ 3.ÏÐ  4.×¯¶Ô 5.ÏÐ¶Ô
                  }  
               }   
        ËµÃ÷:   
            
      
    ¾ßÌå²Î¿¼:    
        var route:string = "bjl.bjlHandler.doBet";    
        var msg={roomId:"1",strBet:"1^20$5^100"};                  //ÏÂ×¢Î»ÖÃ:ÓÉÏÂÖÁÏÂ,ÓÉ×óÖÁÓÒ1-12±êÖ¾
        rPomelo.pomelo.request(route, msg, function(res) {
            console.log("res:",res);
        })


6.È¡Ïû

  ¿Í»§¶ËÂ·ÓÉ:  "bjl.bjlHandler.doCancelBet"            
        ²ÎÊý:  "roomId":3
  
  ·þÎñÆ÷·µ»Ø:  
        ³É¹¦:  {
                 "code":"601",                      //602È¡ÏûÊ§°Ü
                 "msg":"È¡Ïû³É¹¦"
                 "rType":"bjl"
                 "roomId":"3"              
                 "data":{ye:100}                         //Óà¶î
                }

        Ê§°Ü:  { 
                   "code":"602",                    //602È¡ÏûÊ§°Ü
                   "msg":"È¡ÏûÊ§°Ü"
                   "rType":"bjl"
                   "roomId":"3"              
               
                }
      

        
7.ÖØÑº(×÷·Ï)
   ¿Í»§¶ËÂ·ÓÉ:  "bjl.bjlHandler.doReBet"           
        ²ÎÊý:   "roomId":3
  
   ·þÎñÆ÷·µ»Ø:  
               {
                 "code":"701",                      //602ÖØÑºÊ§°Ü
                 "msg":"ÖØÑº³É¹¦"
                 "rType":"bjl"
                 "roomId":"3"              
                 "data":100                         //Óà¶î
                }   


8.»»×À
  Í¬3

9.ÐÄÌø°ü

  ¿Í»§¶ËÂ·ÓÉ: bjl.bjlHandler.chkHardBean
  ·þÎñÆ÷·µ»Ø:
              {
                 "code":"07",                      
                 "msg":"",
                 "rType":"bjl",
                 "roomId":"3",              
                 "data"=""   
               }   

  ¾ßÌå²ÎÊýºÍÖ¸Áî:
      var route:string = "bjl.bjlHandler.chkHardBean";
      pomelo.request(route,function(data) {
          if (data.code=="07")nHeartBeat=0;  
      });         
  

10.»ñÈ¡ÏÂ×¢¼ÇÂ¼(¼Ó)
   ¿Í»§¶ËÂ·ÓÉ:  "connector.entryHandler.getRecord"           
        ²ÎÊý:   "name":"111111"                      //ÕÊºÅ   
                "rType":"bjl"                        //°´ÓÎÏ·²»°´·¿¼ä
                "date":3                             //ÌìÊý·ÖÎª1,3,7Ìì   
                "currentPage":1                      //µ±Ç°Ò³
                "pageSize":20                        //Ò»Ò³20Ìõ 
               
   ·þÎñÆ÷·µ»Ø:  
               {
                 "code":"801",                      
                 "msg":"»ñÈ¡ÏÂ×¢¼ÇÂ¼",
                 "rType":"bjl",
                 "roomId":"",             
                 "data":{
                       jsonData:"userId~rType~roomId~cc~kj~xz~yl~ye~xzmx~stime # ..."                         //·µ»Ø¼ÇÂ¼  xzmz:ÏÂ×¢Ã÷Ï¸  ye:Óà¶î
                       recordCount:1000                                                                       //×Ü¼ÇÂ¼ÌõÊý  
                  }                          
                }   

          ËµÃ÷(data²ÎÊý): ÓÃ»§ID^ÓÎÏ·ÀàÐÍ^·¿¼äºÅ^³¡´Î^¿ª½±^ÏÂ×¢^Ó¯Àû^ÏÂ×¢Ã÷Ï¸^Ê±¼ä# ..  ¶àÌõ¼ÇÂ¼#¸ô¿ª
                          
                          "ÏÂ×¢Ã÷Ï¸"ÓÐ¸öÁ´½Ó,µã»÷ºó·¢ËÍidµ½·þÎñÆ÷È¡µã»÷µÄÏÂ×¢Ã÷Ï¸ÄÚÈÝ                  
  



//¿Í»§¶Ë½ÓÊÕ¹ã²¥Â·ÓÉ(º¯Êý):  onMsg()

11.¿ªÊ¼ÏÂ×¢:
   {
       "code":"03",                      
       "msg":"¿ªÊ¼ÏÂ×¢",
       "rType":"bjl",
       "roomId":"3",             
       "data":
       {
           state:1,                    //×´Ì¬:ÏÂ×¢
           ye:100,                     //Óà¶î:100
           xh:20000,
           desk_limit:20000, 
           phone_desk_limit:20000,    //µç»°×ÀÏÞºì,ÔÝÊ±ÓÃ²»ÉÏ
           betTime:30, 
           road:"abcd",
           bl:"1.97",
           js:"1-100",
           enable:1,                  //ÕÊºÅ½ûÆôÓÃ(1ÆôÓÃ  0½ûÓÃ),Ç°¶ËÊÕµ½0Ö¸Áî,ÔòÍË³ö
       }
    }     
   
    
12.Í£Ö¹ÏÂ×¢
  {
       "code":"04",                      
       "msg":"Í£Ö¹ÏÂ×¢",
       "rType":"bjl",
       "roomId":"3",             
       "data":
       {
           state:2             //×´Ì¬:Í£ÉÏÏÂ×¢
        }
    }   

13.¿ªÅÆ:
   {
       "code":"05",                      
       "msg":"¿ªÅÆ",
       "rType":"bjl",
       "roomId":"3",             
       "data":
       {
           state:3            //×´Ì¬:¿ª½±(»ò½áËã)
           point:3,5         //×¯3µãÏÐ5µã
           result:b           //a:×¯ b:×¯ ÏÐ¶Ô c:×¯ ×¯¶Ô d:×¯ ÏÐ¶Ô ×¯¶Ô e:ÏÐ f:ÏÐ ÏÐ¶Ô g:ÏÐ ×¯¶Ô h:ÏÐ ÏÐ¶Ô ×¯¶Ô i:ºÍ  j:ºÍ ÏÐ¶Ô  k:ºÍ ×¯¶Ô l:ºÍ ÏÐ¶Ô ×¯¶Ô
           pk:a1,a2,c3$a3,b2,d9       //Ëù¿ªÅÆ
       }   
    }

14.½áËã
¡¡£û
       "code":"06",
       "msg":"½áËã",
       "rType":"bjl",
       "roomId":"3",             
       "data":
       {
           state:3            //×´Ì¬:¿ª½±(»ò½áËã)
           xz:10              //ÏÂ×¢
           fh:0               //·µ»¹
           yl:-10                                 //Ó¯Àû
           road:"a-53^b-23",                      //Â·µ¥ aÊÇ×¯ ,53ÊÇ×¯ÏÐµãÊý(×¯ÔÚÇ°£©
        }¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡
¡¡¡¡£ý

15.·¢ÅÆ(µ¥ÕÅ,Ã¿·¢Ò»ÕÅÅÆÏÔÊ¾Ò»ÕÅ)                  //×¢:Ôö¼Ó¹¦ÄÜ
   {
       "code":"08",
       "msg":"·¢µ¥ÕÅÅÆ",
       "rType":"bjl",
       "roomId":"3",             
       "data":
       {
           state:3            //×´Ì¬:¿ª½±(»ò½áËã)
           pk:1^2^a3          //1ÊÇÎ»ÖÃ(1-×¯ 2-ÏÐ 3-×¯  4-ÏÐ 5-×¯²¹ÅÆ 6-ÏÐ²¹ÅÆ,¿ÉÄÜÓÐ±ä)  2ÊÇÅÆÐòºÅ(1-5)  a3:¿ªÊ²Ã´ÅÆ
        }¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡
   }


          
ÒÔÏÂÎª²¹³äÐ­Òé£º



16.·µ»Ø´óÌü:  

  ¿Í»§¶ËÂ·ÓÉ:  "connector.entryHandler.returnGameMap"            //Íæ¼Ò´ÓÓÎÏ··µ»ØÑ¡ÔñÓÎÏ·µÄ´óÌü,·µ»ØÊý¾ÝºÍµÚÒ»´ÎÎÕÊÖÁ¬½Ó·µ»ØÒ»Ñù
        
  ·þÎñÆ÷·µ»Ø:  
    ³É¹¦·µ»Ø:   
              {
                    "code":111,
                    "msg":"Á¬½Ó³É¹¦",
                    "rType":""
                    "roomId":""
                    "data":{ 
                       players:{
                           bjl:0,
                           lh:0,
                           nn:0,
                           xjh:0,
                           dx:0,
                           tts:0,
                           ssc:0,
                           jsk3:0,
                           bjcs:0
                       },
                       url:"http://124.248.226.218:2222/a.jpg^http://124.248.226.218:2222/b.jpg^http://124.248.226.218:2222/c.jpg",
                       msg:" ",
                       wxh:" ",
					    ye:100
                     } 
                }       

        ËµÃ÷:   rType:·¿¼äÀàÐÍ(ÓÎÏ·ÀàÐÍ)    roomId:·¿¼äºÅ  players:¸÷ÓÎÏ·ÈËÊý  url:ÂÖ²¥¹ã¸æµØÖ·,Îª¿Õ¿Í»§¶ËÒ³ÃæÔòÄ¬ÈÏ   msg:´óÌü¹«¸æÐÅÏ¢   wxh:¿Í·þÎ¢ÐÅºÅ
   

17. ¿Í»§¶ËÂ·ÓÉ:  "connector.entryHandler.getOnLineNum"            //ÔÚÓÎÏ·µÄ´óÌü,Ã¿¸ô5Ãë·¢Ò»´Î»ñÈ¡¸÷ÓÎÏ·ÈËÊý£¬ÉÏÃæÐ­ÒéµÄÈ¡ÈËÊýÈ¥µô
        
    ·þÎñÆ÷·µ»Ø:  
    ³É¹¦·µ»Ø:   
              {
                    "code":113,
                    "msg":"Á¬½Ó³É¹¦",
                    "rType":""
                    "roomId":""
                    "data":{ 
                       players:{
                           bjl:0,
                           lh:0,
                           nn:0,
                           xjh:0,
                           dx:0,
                           tts:0,
                           ssc:0,
                           jsk3:0,
                           bjcs:0
                       },
                    } 
                }       

        ËµÃ÷:   rType:·¿¼äÀàÐÍ(ÓÎÏ·ÀàÐÍ)    roomId:·¿¼äºÅ  players:¸÷ÓÎÏ·ÈËÊý  

   

18.kickÖ¸Áî
   ¿Í»§¶ËÈç¹ûÊÕµ½kickÖ¸Áî,Ôò¶Ï¿ªÍøÂç,Í£Ö¹ÖØÁ¬,ÍË»ØµÇÂ¼×´Ì¬


/*
   Ôö¼ÓÊ±¼ä: 2019-10-23  
   Ôö¼ÓÄÚÈÝ: »ñÈ¡½»Ò×¼ÇÂ¼
   Ôö¼Ó¹¦ÄÜ: »ñÈ¡½»Ò×¼ÇÂ¼
*/

19.»ñÈ¡½»Ò×¼ÇÂ¼(¼Ó)
   ¿Í»§¶ËÂ·ÓÉ:  "connector.entryHandler.getTradeRecord"           
        ²ÎÊý:   "name":"111111"                      //ÕÊºÅ   
                "rType":"bjl"                        //°´ÓÎÏ·²»°´·¿¼ä
                "date":3                             //ÌìÊý·ÖÎª1,3,7Ìì   
                "currentPage":1                      //µ±Ç°Ò³
                "pageSize":10                        //Ò»Ò³10Ìõ 
               
   ·þÎñÆ÷·µ»Ø:  
               {
                 "code":"802",                      
                 "msg":"»ñÈ¡½»Ò×¼ÇÂ¼",
                 "rType":"bjl",
                 "roomId":"",             
                 "data":{
                       jsonData:name~type~turnover~totalMoney~time # ..."                                     //·µ»Ø¼ÇÂ¼ name:ÕÊºÅ 
                       recordCount:1000                                                                       //×Ü¼ÇÂ¼ÌõÊý  
                       totalTradeMoney:1000                                                                   //½»Ò×½ð¶îÍ³¼Æ
                  }                          
                }   

          ËµÃ÷(data²ÎÊý): ÕÊºÅ^ÓÎÏ·ÀàÐÍ^½»Ò×½ð¶î^×Ü½ð¶î^Ê±¼ä #                                               //¶àÌõ¼ÇÂ¼#¸ô¿ª
                          
              

/*
   Ôö¼ÓÊ±¼ä: 2019-10-24  
   Ôö¼ÓÄÚÈÝ: ¶àÌ¨ÏÂ×¢
   Ôö¼Ó¹¦ÄÜ: ¶àÌ¨ÊÇ¶àÖÖÓÎÏ··ÅÔÚÒ»¸ö½çÃæ¿ÉÒÔÍ¬Ê±ÏÂ×¢
*/

20.¶àÌ¨: 

  ¿Í»§¶ËÂ·ÓÉ:  "dt.dtHandler.doSelectGame"            
        
  ·þÎñÆ÷·µ»Ø:  { 
                 "code": 103,
                 "msg": "È¡¶àÌ¨ÐÅÏ¢",
                 "rType": "",
                 "roomId": "",
                 "data":"·¿¼äºÅ£¬ÏÞºì£¬×ÀÉÏ³ïÂë£¬ÓÎÏ·×´Ì¬£¬µ¹¼ÆÊ±£¬Â·µ¥,×ÜÈËÊý£¬³¡´Î£¬±¾Íæ¼Ò·ÖÊý£¬ºÉ¹Ù£¬ÏÂ×¢Ã÷Ï¸,·¿¼äÃû,ÊÓÆµµØÖ·,ÅâÂÊ,ÓÎÏ·ÀàÐÍ# ..."           //¶à¸ö·¿¼ä#¸ô¿ª,Èç¹ûdataÖµÎª¿ÕµÄ»°ÔòÃ»ÓÐ·¿¼äÔËÐÐ 
                }

   ×¢Òâ£º·¿¼äºÅºÍ·¿¼äÃûÊÇ²»Ò»ÑùµÄ£¬Ç°¶ËÓëºó¶ËÁªÏµÍ¨¹ý·¿¼äºÅ£¬µ«·¿¼äÃûÊÇÏÔÊ¾¸øÍæ¼Ò¿´µÄ¡£Èç°ÙÀÖ1ºÅ·¿¿ÉÄÜÆäÃû³ÆÊÇvip10,ÒÔºó°´´Ë±ê×¼
   ËµÃ÷: ·µ»ØËùÓÐÑ¡¶¨ÓÎÏ·µÄËùÓÐ·¿¼ä×´Ì¬,Ñ¡Ôñ¶àÌ¨Ê±,½øÈë¶àÌ¨´óÌü,È»ºóÑ¡ÔñÓÎÏ·(¼´Ê¹ÐÐ¸ÃÃüÁî)¡£


/*
   Ôö¼ÓÊ±¼ä: 2019-11-19  
   Ôö¼ÓÄÚÈÝ: Èº·¢×ÀÉÏ³ïÂëºÍÈËÊý(Ã¿3Ãë·¢Ò»´Î)
*/
21.
  {
       "code":"09",                      
       "msg":"ÈËÊý",
       "rType":"bjl",
       "roomId":"3",             
       "data":
       {
           playerNumber:30            //ÔÚÏßÈËÊý
           totalBet:1000              //×ÀÉÏ³ïÂë
       }   
    }

/*
   Ôö¼ÓÊ±¼ä: 2020-05-26  
   Ôö¼ÓÄÚÈÝ: ±¾¾ÖÎÞÐ§,Ç°¶ËÊÕµ½´ËÃüÁîµ¯³ö±¾¾ÖÎÞÐ§£¬²»ÔÙ×ßÃë
*/
22.
  {
       "code":"10",                      
       "msg":"±¾¾ÖÎÞÐ§",
       "rType":"bjl",
       "roomId":"3",             
       "data":
       {
           cc:30            //³¡´Î
           jc:10            //¾Ö´Î
       }   
    }

/*
   Ôö¼ÓÊ±¼ä: 2020-05-26  
   Ôö¼ÓÄÚÈÝ: »»Ñ¥ ,Ç°¶ËÊÕµ½´ËÃüÁîÒªÇå¿ÕËùÓÐÂ·µ¥
*/
23. 
  {
       "code":"11",                      
       "msg":"»»Ñ¥",
       "rType":"bjl",
       "roomId":"3",             
       "data":
       {
           cc:30            ¡¡//¡¡³¡´Î
           jc:10            ¡¡//¡¡¾Ö´Î
       }   
    }

tuzi2278v.com  6C6N7
       